{
  "experience": [
    {
      "title": "avlindfors",
      "role": "Software Engineering Consultant",
      "location": "Earth",
      "duration": {
        "start": "09/2022",
        "end": "present"
      },
      "description": "I founded my one-man consultancy company. Building stuff on the web makes me happy. I'm taking clients in Sweden and all over the world."
    },
    {
      "title": "Alphadev",
      "role": "Software Engineering Consultant",
      "location": "Stockholm, Sweden",
      "duration": {
        "start": "05/2021",
        "end": "present"
      },
      "description": "Alphadev is an agency based in Stockholm. I am on a full-stack developer assignment for a large telecom company. My team develops retail solutions and systems to be used by sales people in different channels. Main technologies are Spring Boot and React."
    },
    {
      "title": "Forefront Consulting",
      "role": "Software Engineering Consultant",
      "location": "Stockholm, Sweden",
      "duration": {
        "start": "01/2020",
        "end": "05/2021"
      },
      "description": "During my time at Forefront Consulting I had an assignment at one of Sweden's largest grocery store chains. We developed payment solutions for online and in-store customers; mainly using Java and the Spring Boot framework."
    },
    {
      "title": "TableCheck",
      "role": "Software Engineer",
      "location": "Tokyo, Japan",
      "duration": {
        "start": "2019",
        "end": "2019"
      },
      "description": "TableCheck, based in Tokyo, provides restaurant management and reservation systems. I was part of the Front End team working mainly with React and Elixir. Besides programming, the position has given me opportunities to explore other aspects of software development, such as architectural direction as well as UI design."
    },
    {
      "title": "Erlang Solutions",
      "role": "Erlang Developer",
      "location": "Stockholm, Sweden",
      "duration": {
        "start": "2017",
        "end": "2018"
      },
      "description": "Erlang Solutons is an Erlang consultancy firm with offices around the world. I mainly worked on MongooseIM, an open-source, massively distributed XMPP messaging platform maintained by the company, using Erlang and related technologies."
    },
    {
      "title": "Ericsson",
      "role": "Software Engineering Intern",
      "location": "Stockholm, Sweden",
      "duration": {
        "start": "2017",
        "end": "2017"
      },
      "description": "Ericsson is a world-leading developer and manufacturer of mobile network solutions. Using the scripting language Expect, I was tasked to create an automated testing framework for one of the cloud functions powering the future 5G mobile networks. I also acted as a contact between teams; holding presentations and teaching sessions to keep everyone up to speed."
    }
  ],

  "education": [
    {
      "title": "KTH, Royal Institute of Technology",
      "role": "BSc in Computer Science",
      "location": "Stockholm, Sweden",
      "duration": {
        "start": "2014",
        "end": "2017"
      },
      "description": "The program is a general Software Engineering program with emphasis on team work and project management. Besides the course classes I also took courses in Human Computer Interaction and Advanced Computer Storage Paradigms."
    },
    {
      "title": "Academy of Language Arts",
      "role": "Japanese Language School",
      "location": "Tokyo, Japan",
      "duration": {
        "start": "2018",
        "end": "2019"
      },
      "description": "I moved to Japan to start learning Japanese at a Japanese Language School. I took 10 months of full time Japanese classes before I found a job and started working."
    }
  ]
}
